window.Faces =  [["/::)", "微笑"], ["/::~", "伤心"], ["/::B", "美女"], ["/::|", "发呆"], ["/:8-)", "墨镜"], ["/::<", "哭"], ["/::$", "羞"], ["/::X", "哑"], ["/::Z", "睡"], ["/::’(", "哭"], ["/::-|", "囧"], ["/::@", "怒"], ["/::P", "调皮"], ["/::D", "笑"], ["/::O", "惊讶"], ["/::(", "难过"], ["/::+", "酷"], ["/:–b", "汗"], ["/::Q", "抓狂"], ["/::T", "吐"], ["/:,@P", "笑"], ["/:,@-D", "快乐"], ["/::d", "奇"], ["/:,@o", "傲"], ["/::g", "饿"], ["/:|-)", "累"], ["/::!", "吓"], ["/::L", "汗"], ["/::>", "高兴"], ["/::,@", "闲"], ["/:,@f", "努力"], ["/::-S", "骂"], ["/:?", "疑问"], ["/:,@x", "秘密"], ["/:,@@", "乱"], ["/::8", "疯"], ["/:,@!", "哀"], ["/:!!!", "鬼"], ["/:xx", "打击"], ["/:bye", "bye"], ["/:wipe", "汗"], ["/:dig", "抠"], ["/:handclap", "鼓掌"], ["/:&-(", "糟糕"], ["/:B-)", "恶搞"], ["/:<@", "什么"], ["/:@>", "什么"], ["/::-O", "累"], ["/:>-|", "看"], ["/:P-(", "难过"], ["/::’|", "难过"], ["/:X-)", "坏"], ["/::*", "亲"], ["/:@x", "吓"], ["/:8*", "可怜"], ["/:pd", "刀"], ["/:<W>", "水果"], ["/:beer", "酒"], ["/:basketb", "篮球"], ["/:oo", "乒乓"], ["/:coffee", "咖啡"], ["/:eat", "美食"], ["/:pig", "动物"], ["/:rose", "鲜花"], ["/:fade", "枯"], ["/:showlove", "唇"], ["/:heart", "爱"], ["/:break", "分手"], ["/:cake", "生日"], ["/:li", "电"]];

window.ToggleFace = function(content){
	$.each(window.Faces, function(index, it){
		var ch = it[0], text = '[' + it[1] + ']';
		content = content.replace(ch, function(){
			return '<img src="/images/spacer.gif" text="' + text + '_web" class="qqemoji qqemoji' + index + '">';
		});

		content = content.replace(text, (function(text, index){
			return function(){
				return '<img src="/images/spacer.gif" text="' + text + '_web" class="qqemoji qqemoji' + index + '">';
			}
		})(text, index));
	});

	return content;
};
